racunalnistvo/ustni_izpit.org
#+title: Ustni Izpit
#+startup: nolatexpreview
#+startup: entitiespretty nil
#+LATEX_HEADER: \usepackage{amsmath}

* Funkcije višjega reda

V programiranju so funkcije višjega reda funkcije, ki sprejmejo neko drugo funkcijo kot argument in/ali vrnejo funkcijo kot rezultat. Primeri takih funkcijo so funkcije ~map, filter~.

Primer uporabe bi bil

#+begin_src python
map(lambda x: x**2, [1, 2, 3])
#+end_src

Funkcija ~map~ sprejme funkcijo (v našem primeru \( x^{2} \))

Primeri funckije višjega so tudi dekoratorji - to so funckije, ki zaobjamejo druge funckije.

#+begin_src python

def home_decorator(fja):

        def notranja_fja():
                print("Pred funkcijo")
                fja()
                print("Po funkciji")

        return notranja_fja

def uporabljena_fja():
        print("znotraj fja")

uporabljena_fja = home_decorator(uporabljena_fja)

#oz. drugače

@home_decorator
uporabljena_fja()

#+end_src
* Rekurzija

Rekurzivna funkcija je funkcija, ki kliče samo sebe. Ključen je robni pogoj.

Tako npr. se obračanje seznama /s/ v /os/ dogaja, dokler je ~len(s)~ < 1.

Poznamo dve možni rekurziji: glava - rep ali pa bisekcija. Glava rep je ima zahtevnost \( O(n ^2) \), saj vsakič ustvarimo nov seznam (\( O(n) \)) in to naredimo \( n \)-krat.
* Preiskovanje

Pri preiskovanju naletimo na urejeno četverico /(S, s, G, \( \sigma \))/.

/S/ je množica vseh rešitev (tudi delnih), te rešitve imenujemo tudi stanja. \( s \in S \) je začetno stanje, \( G \subset S \) je množica vseh končnih stanje, tj. pravih rešitev.

\( \sigma: S \to P(S) \) je funkcija, ki tvori množico naslednikov \( \theta \subset S \) za podano stanje \( q \in S \). Funkcija \( \sigma \) ima nekatere lastnosti:

- z njenim iteriranjem na začetnem stanju \( s \) dobimo vsa stanja iz \( S \) in
- stanja se nikoli ne ponovijo: vsako stanje se pojavi le enkrat.

Funkcija \( \sigma \) ustvari t.i. preiskovalno drevo. Notranja vozlišča so tista, ki so že razvejana s to funkcijo, medtem ko so končna vozlišča tista, ki še niso razvejana. Množici končni vozlišč rečemo /preiskovalna fronta/ oz. /odprti seznam/.

Če smo neinformirani of preiskovalnem drevesu lahko iščemo ali v globino ali pa v širino.

Ko ugotovimo, da naša vaje drevesa, več ne reši danega problema, prekinemo preiskovanje dane veje in se reče, da /sestopimo/.
** Primer: vsota podmnožice

Imamo podana seznam \( x \in \mathbb{N} \) in zaželno vsoto \( v \in \mathbb{N} \). Najti moramo \( y \subset x \) in \( sum(y) = v \).

Na začetku imamo seznam \( x_1 \), ki je seznam neuporabljenih števil, \( u \) je vsota, ki jo moramo še dobiti in \( x_2 \) je delna rešitev.

S pomočjo \( \sigma \) razvejamo naše preiskovalno drevo, imamo pa dve možnosti:
1) stanje je rešitev, ki vsebuje podan element
2) stanje je rešitev, ki ne vsebuje podanega elementa
* Bisekcija

je iskanje števila v urejenem seznamu.

Pri bisekciji imamo urejen seznam \( x \) in pa poizvedbo \( e \), ki je potencialno element seznama \( x \). To sta vhoda, potem pa imamo 2 možna rezultata: indeks \( e \) v \( x \), ali pa ~None~, če \( e \not \in x \).
* Računska zahtevnost algoritma

Poznamo več vrst zahtevnosti, ki nam pove, koliko virov je potrebnih za njegovo izvedbo: časovno, prostorsko in drugo (komunikacija, naključnost ali energija).

/Računska zahtevnost algoritma/ nam pove najmanjšo računsko zahtevnost za njegovo reševanje (torej je lahko tudi več kot izračun).

Zahtevnost je odvisna od velikost vhodnih podatkov (npr. pri seznamu imamo dolžino \( n \) seznama \( x \)).

Definiramo funkcijo \( T: \mathbb{N} \to \mathbb{R}^+_0 \), kjer je \( T(n) \) čas potreben za izvedbo logaritma.

Ker se računalniki množično razlikujejo med sabo, za čas lažje definirati število ključnih operacij, kako definirati čas (procesorki, realen, itd) in zato razbijemo \( T(n) = C \cdot t(n) \), kjer je \( C > 0 \) odvisna od strojne opreme in \( t(n) \), ki je odvisna od algoritma.

Pogosto se ukvarjamo z /asimptotično zahtevnostjo/, ki opisuje porabo virov algoritma pri zelo velikih \( n \), saj je za majhne \( n \) rešitev trivialna.

Zgornjo mejo asimptotične zahtevnosti opisujemo s t.i. notacijo z velikim O-jem.

Notacija z velikim O je definirana kot: naj bosta \( T(n), f(n) > 0 \). Rečemo, da ima \( T(n) \) kompleksnost reda \( f(n) \), če \( T(n) \) raste počasneje kot \( cf(n) \) za \( c > 0 \) in \( n > n_0 \, n_0 \in \mathbb{N} \) oz.

\[ T(n) \in O(f(n)) \iff \exists n_0 \in \mathbb{N}, c >0 \forall n \in \mathbb{N}, n \ge n_0: T(n) \le c f(n)
\]
** Primer: Neurejen seznam

Imamo seznam \( x \) z \( n \) elementi in enota zahtevnosti je število primerjav.

\begin{align*}
T(n) &= T(n - 1) + 1 \\
&= T(n - 2) + 2 \\
&\vdots
&= T(n - (n - 1)) + n - 1
\end{align*}

Tako vidimo, da je časovna zahtevnost \( O(n) \).
** Primer: bisekcija

Enaki pogoji kot prej, vendar imam sedaj na vsakem koraku dve primerjavi (levi in desni del seznama).

\begin{align*}
T(n) &= T(\frac{n}{2}) + 2 \\
&= T( \frac{n}{2 ^2} ) + 2 \cdot 2 \\
&\vdots
&= T(\frac{n}{2^k}) + 2k
\end{align*}

Upoštevamo \( k = \log_2 n \) in \( T(1) = 1 \) in dobimo

\begin{equation}
\label{eq:1}
T(n) = 1 + 2 \log_2 n \in O(\log n)
\end{equation}
