racunalnistvo/ustni_izpit.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-09-13 Fri 00:01 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Ustni Izpit</title>
<meta name="author" content="Kristofer Robin" />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">Ustni Izpit</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orge9a37de">1. Funkcije višjega reda</a></li>
<li><a href="#org9ef4d41">2. Rekurzija</a></li>
<li><a href="#org43f214a">3. Preiskovanje</a>
<ul>
<li><a href="#orgd44343c">3.1. Primer: vsota podmnožice</a></li>
</ul>
</li>
<li><a href="#orgad050b4">4. Bisekcija</a></li>
<li><a href="#org2eea6fb">5. Računska zahtevnost algoritma</a>
<ul>
<li><a href="#orge083fd1">5.1. Primer: Neurejen seznam</a></li>
<li><a href="#org85cb4bc">5.2. Primer: bisekcija</a></li>
</ul>
</li>
<li><a href="#org63328fe">6. Urejanje seznamov</a>
<ul>
<li><a href="#orga848736">6.1. Urejanje z izbiranjem (ang. <i>selection sort</i>)</a></li>
<li><a href="#org79658c9">6.2. Urejanje z zlivanjem (ang. <i>merge sort</i>)</a></li>
<li><a href="#org9cda5dd">6.3. Urejanje z vstavljanjem (ang. <i>insertion sort</i>)</a></li>
<li><a href="#orgedfeb25">6.4. Hitro urejanje (ang. <i>quicksort</i>)</a></li>
<li><a href="#orgbac17d4">6.5. Mehurčno urejanje (ang. <i>bubble sort</i>)</a></li>
</ul>
</li>
<li><a href="#orgd208151">7. Memoizacija</a></li>
<li><a href="#orgacf4517">8. Dinamično programiranje</a>
<ul>
<li><a href="#orgcc7a64c">8.1. Nahrbtnik 0 - 1</a></li>
<li><a href="#org4f11fce">8.2. Najcenejša pot v tabeli</a></li>
</ul>
</li>
<li><a href="#org1247516">9. Regularni izrazi</a></li>
<li><a href="#org1ef7310">10. Hevristično programiranje</a>
<ul>
<li><a href="#org84c99b0">10.1. Preiskovanje v globino (ang. <i>Depth-First Search or SDF</i>)</a></li>
<li><a href="#org8945281">10.2. Preiskovanje v širino (ang. /Bread-First Search or BFS)</a></li>
<li><a href="#org30b4ea1">10.3. Najprej najboljši</a></li>
<li><a href="#orgdbd9f57">10.4. A*</a></li>
</ul>
</li>
<li><a href="#org39c0e7c">11. Vrsta</a></li>
<li><a href="#org9299fa4">12. Kopica</a></li>
<li><a href="#org4bb8635">13. Iskalna drevesa</a>
<ul>
<li><a href="#org780ed79">13.1. AVL drevesa</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orge9a37de" class="outline-2">
<h2 id="orge9a37de"><span class="section-number-2">1.</span> Funkcije višjega reda</h2>
<div class="outline-text-2" id="text-1">
<p>
V programiranju so funkcije višjega reda funkcije, ki sprejmejo neko drugo funkcijo kot argument in/ali vrnejo funkcijo kot rezultat. Primeri takih funkcijo so funkcije <code>map, filter</code>.
</p>

<p>
Primer uporabe bi bil
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #c678dd;">map</span>(<span style="color: #51afef;">lambda</span> x: x**<span style="color: #da8548; font-weight: bold;">2</span>, [<span style="color: #da8548; font-weight: bold;">1</span>, <span style="color: #da8548; font-weight: bold;">2</span>, <span style="color: #da8548; font-weight: bold;">3</span>])
</pre>
</div>

<p>
Funkcija <code>map</code> sprejme funkcijo (v našem primeru \( x^{2} \))
</p>

<p>
Primeri funckije višjega so tudi dekoratorji - to so funckije, ki zaobjamejo druge funckije.
</p>

<div class="org-src-container">
<pre class="src src-python">
<span style="color: #51afef;">def</span> <span style="color: #c678dd;">home_decorator</span>(fja):

        <span style="color: #51afef;">def</span> <span style="color: #c678dd;">notranja_fja</span>():
                <span style="color: #c678dd;">print</span>(<span style="color: #98be65;">"Pred funkcijo"</span>)
                fja()
                <span style="color: #c678dd;">print</span>(<span style="color: #98be65;">"Po funkciji"</span>)

        <span style="color: #51afef;">return</span> notranja_fja

<span style="color: #51afef;">def</span> <span style="color: #c678dd;">uporabljena_fja</span>():
        <span style="color: #c678dd;">print</span>(<span style="color: #98be65;">"znotraj fja"</span>)

<span style="color: #dcaeea;">uporabljena_fja</span> = home_decorator(uporabljena_fja)

<span style="color: #5B6268;">#</span><span style="color: #5B6268;">oz. druga&#269;e</span>

<span style="color: #ECBE7B;">@home_decorator</span>
uporabljena_fja()

</pre>
</div>
</div>
</div>
<div id="outline-container-org9ef4d41" class="outline-2">
<h2 id="org9ef4d41"><span class="section-number-2">2.</span> Rekurzija</h2>
<div class="outline-text-2" id="text-2">
<p>
Rekurzivna funkcija je funkcija, ki kliče samo sebe. Ključen je robni pogoj.
</p>

<p>
Tako npr. se obračanje seznama <i>s</i> v <i>os</i> dogaja, dokler je <code>len(s)</code> &lt; 1.
</p>

<p>
Poznamo dve možni rekurziji: glava - rep ali pa bisekcija. Glava rep je ima zahtevnost \( O(n ^2) \), saj vsakič ustvarimo nov seznam (\( O(n) \)) in to naredimo \( n \)-krat.
</p>
</div>
</div>
<div id="outline-container-org43f214a" class="outline-2">
<h2 id="org43f214a"><span class="section-number-2">3.</span> Preiskovanje</h2>
<div class="outline-text-2" id="text-3">
<p>
Pri preiskovanju naletimo na urejeno četverico <i>(S, s, G, \( \sigma \))</i>.
</p>

<p>
<i>S</i> je množica vseh rešitev (tudi delnih), te rešitve imenujemo tudi stanja. \( s \in S \) je začetno stanje, \( G \subset S \) je množica vseh končnih stanje, tj. pravih rešitev.
</p>

<p>
\( \sigma: S \to P(S) \) je funkcija, ki tvori množico naslednikov \( \theta \subset S \) za podano stanje \( q \in S \). Funkcija \( \sigma \) ima nekatere lastnosti:
</p>

<ul class="org-ul">
<li>z njenim iteriranjem na začetnem stanju \( s \) dobimo vsa stanja iz \( S \) in</li>
<li>stanja se nikoli ne ponovijo: vsako stanje se pojavi le enkrat.</li>
</ul>

<p>
Funkcija \( \sigma \) ustvari t.i. preiskovalno drevo. Notranja vozlišča so tista, ki so že razvejana s to funkcijo, medtem ko so končna vozlišča tista, ki še niso razvejana. Množici končni vozlišč rečemo <i>preiskovalna fronta</i> oz. <i>odprti seznam</i>.
</p>

<p>
Če smo neinformirani of preiskovalnem drevesu lahko iščemo ali v globino ali pa v širino.
</p>

<p>
Ko ugotovimo, da naša vaje drevesa, več ne reši danega problema, prekinemo preiskovanje dane veje in se reče, da <i>sestopimo</i>.
</p>
</div>
<div id="outline-container-orgd44343c" class="outline-3">
<h3 id="orgd44343c"><span class="section-number-3">3.1.</span> Primer: vsota podmnožice</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Imamo podana seznam \( x \in \mathbb{N} \) in zaželno vsoto \( v \in \mathbb{N} \). Najti moramo \( y \subset x \) in \( sum(y) = v \).
</p>

<p>
Na začetku imamo seznam \( x_1 \), ki je seznam neuporabljenih števil, \( u \) je vsota, ki jo moramo še dobiti in \( x_2 \) je delna rešitev.
</p>

<p>
S pomočjo \( \sigma \) razvejamo naše preiskovalno drevo, imamo pa dve možnosti:
</p>
<ol class="org-ol">
<li>stanje je rešitev, ki vsebuje podan element</li>
<li>stanje je rešitev, ki ne vsebuje podanega elementa</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orgad050b4" class="outline-2">
<h2 id="orgad050b4"><span class="section-number-2">4.</span> Bisekcija</h2>
<div class="outline-text-2" id="text-4">
<p>
je iskanje števila v urejenem seznamu.
</p>

<p>
Pri bisekciji imamo urejen seznam \( x \) in pa poizvedbo \( e \), ki je potencialno element seznama \( x \). To sta vhoda, potem pa imamo 2 možna rezultata: indeks \( e \) v \( x \), ali pa <code>None</code>, če \( e \not \in x \).
</p>
</div>
</div>
<div id="outline-container-org2eea6fb" class="outline-2">
<h2 id="org2eea6fb"><span class="section-number-2">5.</span> Računska zahtevnost algoritma</h2>
<div class="outline-text-2" id="text-5">
<p>
Poznamo več vrst zahtevnosti, ki nam pove, koliko virov je potrebnih za njegovo izvedbo: časovno, prostorsko in drugo (komunikacija, naključnost ali energija).
</p>

<p>
<i>Računska zahtevnost algoritma</i> nam pove najmanjšo računsko zahtevnost za njegovo reševanje (torej je lahko tudi več kot izračun).
</p>

<p>
Zahtevnost je odvisna od velikost vhodnih podatkov (npr. pri seznamu imamo dolžino \( n \) seznama \( x \)).
</p>

<p>
Definiramo funkcijo \( T: \mathbb{N} \to \mathbb{R}^+_0 \), kjer je \( T(n) \) čas potreben za izvedbo logaritma.
</p>

<p>
Ker se računalniki množično razlikujejo med sabo, za čas lažje definirati število ključnih operacij, kako definirati čas (procesorki, realen, itd) in zato razbijemo \( T(n) = C \cdot t(n) \), kjer je \( C > 0 \) odvisna od strojne opreme in \( t(n) \), ki je odvisna od algoritma.
</p>

<p>
Pogosto se ukvarjamo z <i>asimptotično zahtevnostjo</i>, ki opisuje porabo virov algoritma pri zelo velikih \( n \), saj je za majhne \( n \) rešitev trivialna.
</p>

<p>
Zgornjo mejo asimptotične zahtevnosti opisujemo s t.i. notacijo z velikim O-jem.
</p>

<p>
Notacija z velikim O je definirana kot: naj bosta \( T(n), f(n) > 0 \). Rečemo, da ima \( T(n) \) kompleksnost reda \( f(n) \), če \( T(n) \) raste počasneje kot \( cf(n) \) za \( c > 0 \) in \( n > n_0 \, n_0 \in \mathbb{N} \) oz.
</p>

<p>
\[ T(n) \in O(f(n)) \iff \exists n_0 \in \mathbb{N}, c >0 \forall n \in \mathbb{N}, n \ge n_0: T(n) \le c f(n)
\]
</p>
</div>
<div id="outline-container-orge083fd1" class="outline-3">
<h3 id="orge083fd1"><span class="section-number-3">5.1.</span> Primer: Neurejen seznam</h3>
<div class="outline-text-3" id="text-5-1">
<p>
Imamo seznam \( x \) z \( n \) elementi in enota zahtevnosti je število primerjav.
</p>

\begin{align*}
T(n) &= T(n - 1) + 1 \\
&= T(n - 2) + 2 \\
&\vdots
&= T(n - (n - 1)) + n - 1
\end{align*}

<p>
Tako vidimo, da je časovna zahtevnost \( O(n) \).
</p>
</div>
</div>
<div id="outline-container-org85cb4bc" class="outline-3">
<h3 id="org85cb4bc"><span class="section-number-3">5.2.</span> Primer: bisekcija</h3>
<div class="outline-text-3" id="text-5-2">
<p>
Enaki pogoji kot prej, vendar imam sedaj na vsakem koraku dve primerjavi (levi in desni del seznama).
</p>

\begin{align*}
T(n) &= T(\frac{n}{2}) + 2 \\
&= T( \frac{n}{2 ^2} ) + 2 \cdot 2 \\
&\vdots
&= T(\frac{n}{2^k}) + 2k
\end{align*}

<p>
Upoštevamo \( k = \log_2 n \) in \( T(1) = 1 \) in dobimo
</p>

\begin{equation}
\label{eq:1}
T(n) = 1 + 2 \log_2 n \in O(\log n)
\end{equation}
</div>
</div>
</div>
