racunalnistvo/ustni_izpit.org
* Urejanje seznamov

Pri kakršnem koli urejanju je vhod seznam dolžine \( n \) x, ki je neurejen in rezultat je seznam y z elementi seznama \( x \), ki so urejeni v naraščajočem vrstnem redu.

** Urejanje z izbiranjem (ang. /selection sort/)

Ne potrebujemo dveh seznamov, ampak samo enega - taki vrsti urejanja se reče urejanje na mestu. Seznam razdelimo na urejeno polovico, ki je na začetku prazna in neurejeno polovico, ki je na začetku \( x \). Najdemo najmanjši element \( m \) v neurejenem seznamu in zamenjamo prvi element neurejenega seznama.  S tem smo podaljšali urejeni del seznama in skrajšali neurejeni del seznama.

Časovna zahtevnost: \( O(n ^2) \).

Zanko ponovimo za vsako vrednost /meje/, ki loči med urejenim in neurejenim. Na začetku je \( m = 0 \) in na koncu je \( m = n - 2 \).

V vsaki ponovitvi pa naredimo za eno manj primerjav kot je dolžina neurejenega seznama ~len(x[m:])~, kar pomeni, da naredimo \( x - m - 1 \) primerjav.

\begin{align*}
T(n) &= \sum_{m = 0}^{n - 2} (n - m - 1) \\
&= \sum_{i = 1}^{n - 1} i && \text{nova spremenljivka i = n - m - 1} \\
&= \frac{n(n-1)}{2} \in O(n ^2)
\end{align*}

** Urejanje z zlivanjem (ang. /merge sort/)

Seznam bisekcijsko razdelimo na levo in desno polovico in vsako posebej uredimo.

Upoštevati moramo, da zlivamo dva urejena seznama v enega, in da prazen seznam in seznam z enim elementov velja za urejenega.

Pri zlivanju dveh urejenih seznamov ~x~ in ~y~ vzamemo manjši element med ~x(i)~ in ~y(j)~ in ga damo v urejen seznam. Temu primerno povečamo ~i~ ali ~j~.

Časovna zahtevnost zlivanja je

\begin{align*}
T(n) &= 2 T(\frac{n}{2}) + n \\
&= 2 (2 T(\frac{n}{2 ^2}) + \frac{n}{2}) + n = 2 ^2 T(\frac{n}{2 ^2}) + 2n \\
&=2 ^3 T(\frac{n}{2 ^3}) + 3n \\
&= 2 ^k T(\frac{n}{2 ^k}) + kn
\end{align*}

Upoštevamo \( T(1) = 1  \)in \( k = \log_2 n \) in dobimo

\begin{equation}
\label{eq:2}
T(n) = n + n \log_2 n \in O(n \log n)
\end{equation}
** Urejanje z vstavljanjem (ang. /insertion sort/)

Iz vhodnega zaporedja jemljemo elemente po vrsti in vsakega posebej vstavimo v novo urejeno zaporedje. Prav tako je možno delati na mestu in ima prav tako \( O(n ^2) \).
** Hitro urejanje (ang. /quicksort/)

Seznam uredimo tako, da ga razdelimo na dva seznama - na seznam z manjšimi elementi in seznam z večjimi elementi. Kateri so manjši in kateri so večji elementi določimo z izbiro pivota (naključno število, lahko je prvi element seznama). Razdeljene sezname ponovno uredimo na enak način.

Za zahtevnost lahko predpostavimo, da seznam razdelimo na polovico, kar potem pomeni zahtevnost enaki zlivanju \( O(n \log n) \), najslabša pa je \( O(n ^2) \).
** Mehurčno urejanje (ang. /bubble sort/)

oz. urejanje z zamenjavami. Izberemo par sosednjih elementov in če je neurejen, ju zamenjamo, da je urejen. Za večjo sistematičnost bomo enkrat šli čez celoten seznam in ponovno se vrnili na začetek ter začeli znova (torej največ \( n - 1 \) prehodov po n). Zahtevnost je tako \( O(n ^2) \), najboljša pa \( O(n) \).
* Memoizacija

Če računamo Fibonaccijevo zaporedje rekurzivno, imamo funkcijo, ki za vsak naslednji člen izračuna od začetka (torej do 1). Namesto tega lahko uporabimo memoizacijo, pri kateri s pomočjo slovarja shranimo pretekle vrednosti funkcije. To ponavadi naredimo s slovarji.

Možnost 1 je, da definiramo funkcijo višjega reda, ki shrani vrednosti funkcije f v cache, vendar namesto nove funkcije g, ki ne prestreže rekurzivnih klicev f, naredimo ~f = memo(f)~.

Lepša rešitev je z dekoratorjem, ki obleče našo funkcijo s funkcijo ~memo~.
* Dinamično programiranje
Dinamično programiranje je optimizacijski algoritem, ki uporablja memoizacijo ter deli in vladaj, da najdemo optimalno rešitev problema.

Torej ponavljajočih problemov ne rešujemo znova, ampak jih memoiziramo.

Velja načelo optimalnosti: optimalna rešitev je sestavljena iz optimalnih rešitev podproblemov.

Recept za sestavljanje rešitev imenujemo /Bellmanova enačba/.
** Nahrbtnik 0 - 1

Imamo seznam x izdelkov označenih z \( x_i \), vsak izdelek ima velikost \( s_i \) in vrednost \( v_i \). Nahrbtnik ima kapaciteto \( c_i \).

Izračunati moramo izbor izdelkov za nahrbtnik \( y \in {0, 1, \ldots, n -1} \), ki imajo največjo vrednost \( v = \sum_{i \in y} v_i \) in upoštevamo omejitev \( \sum_{i\in y} s_i \le c \).

Optimalni izbor označimo z \( v(i,c) \), in robni so \( c = 0 \), da ni več prostora in je rešitev \( y = [] \) ali pa \( i = n \), ni več izdelkov na voljo, enaka rešitev.

Problem razdelimo na dva podproblema:

1) \( s_i > c \), problem rešimo V(i + 1, c) ali
2) \( s_i < c \), izdelek \( x_i \) lahko zapakiramo in
   a) če \( x_i \) zapakiramo, rešujem V(i + 1, c - s_i)
   b) če \( x_i \) ne izberemo, rešujemo V(i + 1, c )
      in izberemo tisto, ki ima boljšo rešitev.

Bellmanova enačba je tako

\[
v(i, c) = \begin{cases}
0 & i \ge n - 1 \forall c \\
v(i + 1, c) & s_i > c \\
max\{v(i + 1, c - s_i), v(i + 1, c)\} & s_i \le c
\end{cases}
\]
** Najcenejša pot v tabeli
* Regularni izrazi

Niz znakov, ki določa iskalni vzorec.

Sestavljeni so iz črk podane abecede ter treh regularnih operatorjev: stik (ab), unija ( a ali b ) in iteracija (ponovitve a).
