racunalnistvo/ustni_izpit.html
<div id="outline-container-org63328fe" class="outline-2">
<h2 id="org63328fe"><span class="section-number-2">6.</span> Urejanje seznamov</h2>
<div class="outline-text-2" id="text-6">
<p>
Pri kakršnem koli urejanju je vhod seznam dolžine \( n \) x, ki je neurejen in rezultat je seznam y z elementi seznama \( x \), ki so urejeni v naraščajočem vrstnem redu.
</p>
</div>
<div id="outline-container-orga848736" class="outline-3">
<h3 id="orga848736"><span class="section-number-3">6.1.</span> Urejanje z izbiranjem (ang. <i>selection sort</i>)</h3>
<div class="outline-text-3" id="text-6-1">
<p>
Ne potrebujemo dveh seznamov, ampak samo enega - taki vrsti urejanja se reče urejanje na mestu. Seznam razdelimo na urejeno polovico, ki je na začetku prazna in neurejeno polovico, ki je na začetku \( x \). Najdemo najmanjši element \( m \) v neurejenem seznamu in zamenjamo prvi element neurejenega seznama.  S tem smo podaljšali urejeni del seznama in skrajšali neurejeni del seznama.
</p>

<p>
Časovna zahtevnost: \( O(n ^2) \).
</p>

<p>
Zanko ponovimo za vsako vrednost <i>meje</i>, ki loči med urejenim in neurejenim. Na začetku je \( m = 0 \) in na koncu je \( m = n - 2 \).
</p>

<p>
V vsaki ponovitvi pa naredimo za eno manj primerjav kot je dolžina neurejenega seznama <code>len(x[m:])</code>, kar pomeni, da naredimo \( x - m - 1 \) primerjav.
</p>

\begin{align*}
T(n) &= \sum_{m = 0}^{n - 2} (n - m - 1) \\
&= \sum_{i = 1}^{n - 1} i && \text{nova spremenljivka i = n - m - 1} \\
&= \frac{n(n-1)}{2} \in O(n ^2)
\end{align*}
</div>
</div>
<div id="outline-container-org79658c9" class="outline-3">
<h3 id="org79658c9"><span class="section-number-3">6.2.</span> Urejanje z zlivanjem (ang. <i>merge sort</i>)</h3>
<div class="outline-text-3" id="text-6-2">
<p>
Seznam bisekcijsko razdelimo na levo in desno polovico in vsako posebej uredimo.
</p>

<p>
Upoštevati moramo, da zlivamo dva urejena seznama v enega, in da prazen seznam in seznam z enim elementov velja za urejenega.
</p>

<p>
Pri zlivanju dveh urejenih seznamov <code>x</code> in <code>y</code> vzamemo manjši element med <code>x(i)</code> in <code>y(j)</code> in ga damo v urejen seznam. Temu primerno povečamo <code>i</code> ali <code>j</code>.
</p>

<p>
Časovna zahtevnost zlivanja je
</p>

\begin{align*}
T(n) &= 2 T(\frac{n}{2}) + n \\
&= 2 (2 T(\frac{n}{2 ^2}) + \frac{n}{2}) + n = 2 ^2 T(\frac{n}{2 ^2}) + 2n \\
&=2 ^3 T(\frac{n}{2 ^3}) + 3n \\
&= 2 ^k T(\frac{n}{2 ^k}) + kn
\end{align*}

<p>
Upoštevamo \( T(1) = 1  \)in \( k = \log_2 n \) in dobimo
</p>

\begin{equation}
\label{eq:2}
T(n) = n + n \log_2 n \in O(n \log n)
\end{equation}
</div>
</div>
<div id="outline-container-org9cda5dd" class="outline-3">
<h3 id="org9cda5dd"><span class="section-number-3">6.3.</span> Urejanje z vstavljanjem (ang. <i>insertion sort</i>)</h3>
<div class="outline-text-3" id="text-6-3">
<p>
Iz vhodnega zaporedja jemljemo elemente po vrsti in vsakega posebej vstavimo v novo urejeno zaporedje. Prav tako je možno delati na mestu in ima prav tako \( O(n ^2) \).
</p>
</div>
</div>
<div id="outline-container-orgedfeb25" class="outline-3">
<h3 id="orgedfeb25"><span class="section-number-3">6.4.</span> Hitro urejanje (ang. <i>quicksort</i>)</h3>
<div class="outline-text-3" id="text-6-4">
<p>
Seznam uredimo tako, da ga razdelimo na dva seznama - na seznam z manjšimi elementi in seznam z večjimi elementi. Kateri so manjši in kateri so večji elementi določimo z izbiro pivota (naključno število, lahko je prvi element seznama). Razdeljene sezname ponovno uredimo na enak način.
</p>

<p>
Za zahtevnost lahko predpostavimo, da seznam razdelimo na polovico, kar potem pomeni zahtevnost enaki zlivanju \( O(n \log n) \), najslabša pa je \( O(n ^2) \).
</p>
</div>
</div>
<div id="outline-container-orgbac17d4" class="outline-3">
<h3 id="orgbac17d4"><span class="section-number-3">6.5.</span> Mehurčno urejanje (ang. <i>bubble sort</i>)</h3>
<div class="outline-text-3" id="text-6-5">
<p>
oz. urejanje z zamenjavami. Izberemo par sosednjih elementov in če je neurejen, ju zamenjamo, da je urejen. Za večjo sistematičnost bomo enkrat šli čez celoten seznam in ponovno se vrnili na začetek ter začeli znova (torej največ \( n - 1 \) prehodov po n). Zahtevnost je tako \( O(n ^2) \), najboljša pa \( O(n) \).
</p>
</div>
</div>
</div>
<div id="outline-container-orgd208151" class="outline-2">
<h2 id="orgd208151"><span class="section-number-2">7.</span> Memoizacija</h2>
<div class="outline-text-2" id="text-7">
<p>
Če računamo Fibonaccijevo zaporedje rekurzivno, imamo funkcijo, ki za vsak naslednji člen izračuna od začetka (torej do 1). Namesto tega lahko uporabimo memoizacijo, pri kateri s pomočjo slovarja shranimo pretekle vrednosti funkcije. To ponavadi naredimo s slovarji.
</p>

<p>
Možnost 1 je, da definiramo funkcijo višjega reda, ki shrani vrednosti funkcije f v cache, vendar namesto nove funkcije g, ki ne prestreže rekurzivnih klicev f, naredimo <code>f = memo(f)</code>.
</p>

<p>
Lepša rešitev je z dekoratorjem, ki obleče našo funkcijo s funkcijo <code>memo</code>.
</p>
</div>
</div>
<div id="outline-container-orgacf4517" class="outline-2">
<h2 id="orgacf4517"><span class="section-number-2">8.</span> Dinamično programiranje</h2>
<div class="outline-text-2" id="text-8">
<p>
Dinamično programiranje je optimizacijski algoritem, ki uporablja memoizacijo ter deli in vladaj, da najdemo optimalno rešitev problema.
</p>

<p>
Torej ponavljajočih problemov ne rešujemo znova, ampak jih memoiziramo.
</p>

<p>
Velja načelo optimalnosti: optimalna rešitev je sestavljena iz optimalnih rešitev podproblemov.
</p>

<p>
Recept za sestavljanje rešitev imenujemo <i>Bellmanova enačba</i>.
</p>
</div>
<div id="outline-container-orgcc7a64c" class="outline-3">
<h3 id="orgcc7a64c"><span class="section-number-3">8.1.</span> Nahrbtnik 0 - 1</h3>
<div class="outline-text-3" id="text-8-1">
<p>
Imamo seznam x izdelkov označenih z \( x_i \), vsak izdelek ima velikost \( s_i \) in vrednost \( v_i \). Nahrbtnik ima kapaciteto \( c_i \).
</p>

<p>
Izračunati moramo izbor izdelkov za nahrbtnik \( y \in {0, 1, \ldots, n -1} \), ki imajo največjo vrednost \( v = \sum_{i \in y} v_i \) in upoštevamo omejitev \( \sum_{i\in y} s_i \le c \).
</p>

<p>
Optimalni izbor označimo z \( v(i,c) \), in robni so \( c = 0 \), da ni več prostora in je rešitev \( y = [] \) ali pa \( i = n \), ni več izdelkov na voljo, enaka rešitev.
</p>

<p>
Problem razdelimo na dva podproblema:
</p>

<ol class="org-ol">
<li>\( s_i > c \), problem rešimo V(i + 1, c) ali</li>
<li>\( s_i < c \), izdelek \( x_i \) lahko zapakiramo in
<ol class="org-ol">
<li>če \( x_i \) zapakiramo, rešujem V(i + 1, c - s<sub>i</sub>)</li>
<li>če \( x_i \) ne izberemo, rešujemo V(i + 1, c )
in izberemo tisto, ki ima boljšo rešitev.</li>
</ol></li>
</ol>

<p>
Bellmanova enačba je tako
</p>

<p>
\[
v(i, c) = \begin{cases}
0 & i \ge n - 1 \forall c \\
v(i + 1, c) & s_i > c \\
max\{v(i + 1, c - s_i), v(i + 1, c)\} & s_i \le c
\end{cases}
\]
</p>
</div>
</div>
<div id="outline-container-org4f11fce" class="outline-3">
<h3 id="org4f11fce"><span class="section-number-3">8.2.</span> Najcenejša pot v tabeli</h3>
</div>
</div>
<div id="outline-container-org1247516" class="outline-2">
<h2 id="org1247516"><span class="section-number-2">9.</span> Regularni izrazi</h2>
<div class="outline-text-2" id="text-9">
<p>
Niz znakov, ki določa iskalni vzorec.
</p>

<p>
Sestavljeni so iz črk podane abecede ter treh regularnih operatorjev: stik (ab), unija ( a ali b ) in iteracija (ponovitve a).
</p>
</div>
</div>
