racunalnistvo/ustni_izpit.html
<div id="outline-container-org1ef7310" class="outline-2">
<h2 id="org1ef7310"><span class="section-number-2">10.</span> Hevristično programiranje</h2>
<div class="outline-text-2" id="text-10">
<p>
Hevristično programiranje je programiranje, ki se ne osredotoča na racionalno, logično, optimalno rešitev, ampak rešitev, ki je &ldquo;good enough&rdquo; in zadosti hiter.
</p>

<p>
Prostor možnih rešitev delimo na usmerjene/informirane, ki upoštevajo cene rešitev in pa neusmerjene/neinformirane, ki tega ne naredijo.
</p>

<p>
Preiskovalne strategije primerjamo s kriteriji: popolnost (ang. <i>completeness</i>) - vedno najde rešitev, optimalnost (ang. <i>optimality</i>) - vedno najde optimalno rešitev ter časovna/prostorska zahtevnost.
</p>

<p>
Parametri prostora stanj, ki vplivajo na zahtevnost so:
</p>
<ol class="org-ol">
<li>velikost prostora stanj</li>
<li>b, stopnja razvejanosti</li>
<li>d, najmanjša razdalja med začetnim stanje in rešitvijo</li>
<li>m, dolžina najdaljše poti v prostoru stanj</li>
</ol>

<p>
Če imamo problem P, lahko uporabimo različne pristope za preiskovanje možnih rešitev. Najpogostejši so iskanje v globino, širino, iterativno poglabljanje, najprej najboljši, A*
</p>

<p>
Pri hevristiki imamo pogled naprej. Če imamo trenutno ceno \( g(s) = c(s_0, s) \), kjer je \( s_0 \) začetno stanje in c je razdalja med \( s \) in \( s_0 \).
</p>

<p>
Hevristika je funkcija \( h: S \to \mathbb{R} \), ki oceni dolžino(ceno) poti do cilja: \( h(s) \approx c(s, s_{G}) \), kjer je S prostor stanj in G rešitev.
</p>

<p>
Pri hevristiki imamo dve komponenti: znano ceno delne rešitve do trenutne točke \( g(s) \) in ceno rešitve \( h(s) \) od trenutnega do končnega stanja.
</p>

<p>
Hevristika je sprejemljiva, če velja \( h(s) \le c(s, s_G) \). Ekstremna primera sta \( h(s) = 0 \) je neuporabna hevristika, A* postane najprej najboljši, \( h(s) = c(s, S_G) \), ki je super, vendar predraga za izračunati. Dobra hevristika je tista, kjer je razlika \( c(s, S_G) - h(s) \) čim manjša.
</p>
</div>
<div id="outline-container-org84c99b0" class="outline-3">
<h3 id="org84c99b0"><span class="section-number-3">10.1.</span> Preiskovanje v globino (ang. <i>Depth-First Search or SDF</i>)</h3>
<div class="outline-text-3" id="text-10-1">
<p>
Algoritem začne na eni veji grafa in se premika po veji do konca, pred prehodom na drugo vejo. Primeren za labirint/ šah. Nima popolnosti ali optimalnosti in zahtevnost je prostorska linearna, časovnost eksponentna \( O(b ^d) \) LIFO
</p>
</div>
</div>
<div id="outline-container-org8945281" class="outline-3">
<h3 id="org8945281"><span class="section-number-3">10.2.</span> Preiskovanje v širino (ang. /Bread-First Search or BFS)</h3>
<div class="outline-text-3" id="text-10-2">
<p>
Algoritem začne na začetku in preiskuje vse točke, ki so na istem lvl. Uporabno je pri iskanju najkrajših poti pri neuteženih grafih ter iskanju rešitve blizu začetnega stanja. Ima popolnost, vendar ne optimalnosti, obe zahtevnosti eksponentni.
</p>
</div>
</div>
<div id="outline-container-org30b4ea1" class="outline-3">
<h3 id="org30b4ea1"><span class="section-number-3">10.3.</span> Najprej najboljši</h3>
<div class="outline-text-3" id="text-10-3">
<p>
Iz naslednjih vozlišč izbere tisti z najboljšo oceno za nadaljne raziskovanje, ki je pridobljena na podlagi znanih/preteklih podatko.
</p>

<p>
Je boljša od BFS alid DFS, ker uporabi sedanjo ceno, in ima popolnost ter optimalnost, sta pa obe zahtevnosti eksponentni.
</p>
</div>
</div>
<div id="outline-container-orgdbd9f57" class="outline-3">
<h3 id="orgdbd9f57"><span class="section-number-3">10.4.</span> A*</h3>
<div class="outline-text-3" id="text-10-4">
<p>
Razvejamo najprej tisto stanje, ki vodi k najbolj obetavni rešitvi - minimalni vrednosti vsote komponent.
</p>

<p>
Ima popolnost in optimalnost pod pogojem sprejemljivosti, nižja prostorska in časovna zahtevnost za dobro hevristiko in visoka za slabo
</p>
</div>
</div>
</div>
<div id="outline-container-org39c0e7c" class="outline-2">
<h2 id="org39c0e7c"><span class="section-number-2">11.</span> Vrsta</h2>
<div class="outline-text-2" id="text-11">
<p>
Je podatkovna struktura, kar je format za organiziranje, upravljanje in shranjevanje podatkov. Prav tako podatkovna struktura omogoča učinkovit dostop do podatkov ter njihovo učinkovito spreminjanje.
</p>

<p>
Funkcija doda podatek na konec vrste in jemlje podatek iz začetka vrsta ai. queue FIFO in je uporabna pri iskanju v širino ali kot medpomnilnik.
</p>

<p>
Primer s seznamom \( s \) dolžine \( l \). Imamo tri podatkovne elemente: seznam \( s \), \( z \) je indeks prvega elementa v vrsti in \( k \) je prvi indeks prve proste lokacije.
</p>

<p>
Dodamo element preko <code>s[k] = x</code> in \( k = k+1 \). Če je bil \( k = l -1  \), je \( k=0 \) in računamo po modulu \( l \).
</p>

<p>
Vzamemo element <code>s[z]</code> in \( z = z+1 \) in spet računamo po modulu \( l \).
</p>

<p>
Če je \( z = k \) imamo prazen seznam in če \( (k + 1) - z = 0 \) imamo poln seznam, vendar če imamo krožen seznam veljata neenakosti \( z > k, \, z < k \)
</p>
</div>
</div>
<div id="outline-container-org9299fa4" class="outline-2">
<h2 id="org9299fa4"><span class="section-number-2">12.</span> Kopica</h2>
<div class="outline-text-2" id="text-12">
<p>
Ali prioritetna vrsta (ang. <i>priority queue</i>). Dodamo podatek s pridruženo numerično prioriteto, in jemljemo podatek z najvišjo prioriteto. Uporabno je pri računanju minimuma, maksimuma, mediane ali drugih kvartilov.
</p>

<p>
Če imamo urejen seznam po padajoči prioriteti, je jemanje elementa z najvišjo prioriteto \( O(1) \) in dodamo element z bisekcijo \( O(\log n) \) ali vrivanje \( O(n) \).
</p>

<p>
Če imamo neurejen seznam je jemanje elementa z najvišjo prioriteto \( O(n) \) in dodamo vedno na konec seznam \( O(1) \).
</p>

<p>
Kopica je dvojiško drevo in element v korenu ima najvišjo prioriteto. Če vzamemo element z najvišjo prioriteto, vzamemo koren, zahtevnost \( O(1) \), če dodamo element, ga dodamo v prvo prosto vozlišče in popravimo kopico.
</p>

<p>
Če damo drevo v seznam, je koren prvi element seznama <code>s[0]</code>, levi potomec je <code>s[2i + 1]</code> in desni potomec <code>s[2i + 2]</code>. Prednik vozlišča <code>s[i]</code> je <code>s[(i - 1)//2]</code>
Zahtevnost časovna je \( O(\log n) \)
</p>
</div>
</div>
<div id="outline-container-org4bb8635" class="outline-2">
<h2 id="org4bb8635"><span class="section-number-2">13.</span> Iskalna drevesa</h2>
<div class="outline-text-2" id="text-13">
<p>
Iskalno drevo shranjuje iskalne ključe. Mora biti zmožen dodati nov ključ in iskat ključ ter ugotoviti ali je v drevesu.
</p>

<p>
Drevo je lahko globine \( \log_2 n < d < n \), kjer je \( n \) število vozlišč. Če je \( d = n \) je izrojeno.
</p>

<p>
Glavna lastnost iskalnega dvojiškega drevesa je to, da so vsi potomci na levi manjši od prednika in vsi potomci na desni večji od prednika.
</p>

<p>
časovne zahtevnosti:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">prazno drevo</td>
<td class="org-left">O(1)</td>
</tr>

<tr>
<td class="org-left">poišči element</td>
<td class="org-left">O(d)</td>
</tr>

<tr>
<td class="org-left">vstavi element</td>
<td class="org-left">O(d)</td>
</tr>

<tr>
<td class="org-left">zbriši element</td>
<td class="org-left">O(d)</td>
</tr>
</tbody>
</table>
</div>
<div id="outline-container-org780ed79" class="outline-3">
<h3 id="org780ed79"><span class="section-number-3">13.1.</span> AVL drevesa</h3>
<div class="outline-text-3" id="text-13-1">
<p>
Želimo imeti \( d = \log_2 n \) in odgovor na to je uravnovešeno drevo. Dvojiško drevo je uravnovešeno, če \( \forall \) vozlišču \( n \in T \) velja, da \( \left| h_A - h_B \right|  \le 1 \).
</p>

<p>
Drevo AVL (Adelson-Velsky in Landis) je uravnovešeno.
</p>

<p>
Časovne zahtevnosti so
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Iskalno drevo</td>
<td class="org-left">O(1)</td>
</tr>

<tr>
<td class="org-left">poišči element</td>
<td class="org-left">O(log<sub>2</sub> n)</td>
</tr>

<tr>
<td class="org-left">vstavi element</td>
<td class="org-left">isto</td>
</tr>

<tr>
<td class="org-left">zbriši element</td>
<td class="org-left">isto</td>
</tr>
</tbody>
</table>

<p>
Drevo uravnovesimo s pivotiranjem. Element vstavimo kot list, na veji od lista do korena popravimo zapisane globine vozlišč, preverimo uravnoteženost in neuravnotežena popravimo. Enako pri brisanju.
</p>

<p>
Pivotiranje leva in desna rotacija.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Kristofer Robin</p>
<p class="date">Created: 2024-09-13 Fri 00:01</p>
</div>
</body>
</html>
